In [7]:
import pandas as pd
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [8]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1,inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [9]:
target=df.Survived
inputs=df.drop(['Survived'],axis=1)

In [10]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [12]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [15]:
inputs=pd.concat([df,dummies],axis=1)
inputs.head()

   Pclass     Sex   Age     Fare  Survived  female  male
0       3    male  22.0   7.2500         0       0     1
1       1  female  38.0  71.2833         1       1     0
2       3  female  26.0   7.9250         1       1     0
3       1  female  35.0  53.1000         1       1     0
4       3    male  35.0   8.0500         0       0     1

In [16]:
inputs.drop(['Sex'],axis=1,inplace=True)
inputs.head(3)

   Pclass   Age     Fare  Survived  female  male
0       3  22.0   7.2500         0       0     1
1       1  38.0  71.2833         1       1     0
2       3  26.0   7.9250         1       1     0

In [17]:
inputs.columns

Index(['Pclass', 'Age', 'Fare', 'Survived', 'female', 'male'], dtype='object')

In [20]:
inputs.isna().any()

Pclass      False
Age          True
Fare        False
Survived    False
female      False
male        False
dtype: bool

In [21]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [23]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [26]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  Survived  female  male
0       3  22.000000   7.2500         0       0     1
1       1  38.000000  71.2833         1       1     0
2       3  26.000000   7.9250         1       1     0
3       1  35.000000  53.1000         1       1     0
4       3  35.000000   8.0500         0       0     1
5       3  29.699118   8.4583         0       0     1
6       1  54.000000  51.8625         0       0     1
7       3   2.000000  21.0750         0       0     1
8       3  27.000000  11.1333         1       1     0
9       2  14.000000  30.0708         1       1     0

In [27]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [43]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [44]:
len(X_train)

712

In [45]:
len(X_test)

179

In [46]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [47]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [48]:
model.score(X_test,y_test)

1.0

In [49]:
X_test[:10]

     Pclass        Age     Fare  Survived  female  male
586       2  47.000000  15.0000         0       0     1
821       3  27.000000   8.6625         1       0     1
823       3  27.000000  12.4750         1       1     0
697       3  29.699118   7.7333         1       1     0
688       3  18.000000   7.7958         0       0     1
365       3  30.000000   7.2500         0       0     1
124       1  54.000000  77.2875         0       0     1
245       1  44.000000  90.0000         0       0     1
263       1  40.000000   0.0000         0       0     1
645       1  48.000000  76.7292         1       0     1

In [50]:
y_test[:10]

586    0
821    1
823    1
697    1
688    0
365    0
124    0
245    0
263    0
645    1
Name: Survived, dtype: int64

In [52]:
model.predict(X_test[:10])

array([0, 1, 1, 1, 0, 0, 0, 0, 0, 1])

In [53]:
model.predict_proba(X_test[:10])

array([[1., 0.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [1., 0.],
       [0., 1.]])